example/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.5;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
  #includeFunc residuals
  forceCoeffs_object
  {
    type forceCoeffs;
    functionObjectLibs ("libforces.so");
 
    enabled true;
 
    patches ("airfoil");
 
    pName p;
    Uname U;
 
    // only for incompressible flows
    rho rhoInf;
    rhoInf rhoInf_variable;
 
    log true;
 
    CofR (0.25 0 0);
 
    pitchAxis (0 0 1);
    magUInf magUInf_variable;
    lRef 1;
    Aref 1;
    writeControl   timeStep;
    writeInterval  1;
     
    liftDir     liftDir_variable;
    dragDir     dragDir_variable;
  }
}

// ************************************************************************* //
