example/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 | 
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox 
   \    /   O peration     | Website:  https://openfoam.org 
    \  /    A nd           | Version:  v2206 
     \/     M anipulation  | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1; 

vertices
(
    (0.0 0.0 0)
    (21.0 -10.0 0)
    (1.874885892508946 -10.0 0)
    (0.0 -10.0 0)
    (-10.0 0.0 0)
    (0.0 10.0 0)
    (1.874885892508946 10.0 0)
    (21.0 10.0 0)
    (21.0 -0.9155933341662296 0)
    (21.0 -1.0155933341662295 0)
    (21.0 -1.1155933341662296 0)
    (1.0152677536663017 0.09882760595089377 0)
    (1.0 0.0 0)
    (1.0034267852890304 -0.09994126846594896 0)
    (0.24032174137190138 0.18750718754669488 0)
    (0.25 0.08797663289171652 0)
    (0.25 -0.023568230136070675 0)
    (0.2596782586280986 -0.12309878479104905 0)
    (-0.1 0.0 0)
    (0.0 0.0 1)
    (21.0 -10.0 1)
    (1.874885892508946 -10.0 1)
    (0.0 -10.0 1)
    (-10.0 0.0 1)
    (0.0 10.0 1)
    (1.874885892508946 10.0 1)
    (21.0 10.0 1)
    (21.0 -0.9155933341662296 1)
    (21.0 -1.0155933341662295 1)
    (21.0 -1.1155933341662296 1)
    (1.0152677536663017 0.09882760595089377 1)
    (1.0 0.0 1)
    (1.0034267852890304 -0.09994126846594896 1)
    (0.24032174137190138 0.18750718754669488 1)
    (0.25 0.08797663289171652 1)
    (0.25 -0.023568230136070675 1)
    (0.2596782586280986 -0.12309878479104905 1)
    (-0.1 0.0 1)
);

blocks
(
    hex (2 1 10 13 21 20 29 32) (166 92 1) simpleGrading (10.473481782607713 56.42972656774915 56.42972656774915 10.473481782607713 0.011321109819800957 0.011321109819800957 0.011321109819800957 0.011321109819800957 1 1 1 1) 
    hex (3 2 13 17 22 21 32 36) (68 92 1) simpleGrading (0.9712069752346237 1.788026043383941 1.788026043383941 0.9712069752346237 0.011355778268561639 0.011321109819800957 0.011321109819800957 0.011355778268561639 1 1 1 1) 
    hex (4 3 17 18 23 22 36 37) (31 92 1) edgeGrading (0.0125 0.5 0.5 0.0125 0.011321109819800957 0.011355778268561639 0.011355778268561639 0.011321109819800957 1 1 1 1) 
    hex (4 18 14 5 23 37 33 24) (92 31 1) edgeGrading (0.011321109819800957 0.011451786075944825 0.011451786075944825 0.011321109819800957 0.0125 0.5 0.5 0.0125 1 1 1 1) 
    hex (14 11 6 5 33 30 25 24) (63 92 1) edgeGrading (1.4676892600694702 0.9712069752346237 0.9712069752346237 1.4676892600694702 87.3226231583701 88.33056263185172 88.33056263185172 87.3226231583701 1 1 1 1) 
    hex (11 8 7 6 30 27 26 25) (166 92 1) simpleGrading (56.42972656774915 10.473481782607713 10.473481782607713 56.42972656774915 88.33056263185172 88.33056263185172 88.33056263185172 88.33056263185172 1 1 1 1) 
    hex (12 9 8 11 31 28 27 30) (166 46 1) simpleGrading (56.42972656774915 9.434258183167465 1) 
    hex (15 12 11 14 34 31 30 33) (63 46 1) edgeGrading (0.8 1.4676892600694702 1.4676892600694702 0.8 9.434258183167465 9.434258183167465 9.434258183167465 9.434258183167465 1 1 1 1) 
    hex (0 15 14 18 19 34 33 37) (31 46 1) edgeGrading (2 0.5 0.5 2 9.434258183167465 9.434258183167465 9.434258183167465 9.434258183167465 1 1 1 1) 
    hex (18 17 16 0 37 36 35 19) (31 46 1) edgeGrading (0.5 2 2 0.5 0.10599667515822206 0.10599667515822206 0.10599667515822206 0.10599667515822206 1 1 1 1) 
    hex (17 13 12 16 36 32 31 35) (68 46 1) edgeGrading (1.788026043383941 0.8 0.8 1.788026043383941 0.10599667515822206 0.10599667515822206 0.10599667515822206 0.10599667515822206 1 1 1 1) 
    hex (13 10 9 12 32 29 28 31) (166 46 1) simpleGrading (56.42972656774915 0.10599667515822206 1) 
);

edges
(
    polyLine 11 14
    (
        (0.9585252665332352 0.10554606918186223 0)
        (0.933883818539795 0.10935102634860216 0)
        (0.9088001010357735 0.11353244315610486 0)
        (0.886560643943815 0.11753721153338843 0)
        (0.8664537988730969 0.12143302338612713 0)
        (0.8465178041125916 0.1254842597057256 0)
        (0.8262068371149728 0.12971651587687805 0)
        (0.8054848710285957 0.134056728060604 0)
        (0.7843340493458683 0.13841122147321983 0)
        (0.7624660365969042 0.14277181215512033 0)
        (0.7391408197398053 0.14728149940443114 0)
        (0.714161269576115 0.15200616825201108 0)
        (0.6882649313475501 0.1568261622213628 0)
        (0.662023936843935 0.16161009016626984 0)
        (0.6355125583565305 0.16627266605117053 0)
        (0.6087496113562257 0.17072930257578053 0)
        (0.5818594858769538 0.1748957696797893 0)
        (0.5549929582977443 0.17873987650329712 0)
        (0.5280873552751782 0.1822931457966907 0)
        (0.5007827142053005 0.18555403690775535 0)
        (0.4721344479624742 0.1884382804409715 0)
        (0.4402531497565428 0.19076941430210181 0)
        (0.4042336315889362 0.1923971394936283 0)
        (0.3678405630192846 0.19327329991219405 0)
        (0.3365939531650711 0.1933775491591253 0)
        (0.3106475422821223 0.1927510557220498 0)
        (0.28653082833451676 0.19147883153281725 0)
        (0.2609461786795975 0.18950832021058195 0)
    )
    polyLine 30 33
    (
        (0.9585252665332352 0.10554606918186223 1)
        (0.933883818539795 0.10935102634860216 1)
        (0.9088001010357735 0.11353244315610486 1)
        (0.886560643943815 0.11753721153338843 1)
        (0.8664537988730969 0.12143302338612713 1)
        (0.8465178041125916 0.1254842597057256 1)
        (0.8262068371149728 0.12971651587687805 1)
        (0.8054848710285957 0.134056728060604 1)
        (0.7843340493458683 0.13841122147321983 1)
        (0.7624660365969042 0.14277181215512033 1)
        (0.7391408197398053 0.14728149940443114 1)
        (0.714161269576115 0.15200616825201108 1)
        (0.6882649313475501 0.1568261622213628 1)
        (0.662023936843935 0.16161009016626984 1)
        (0.6355125583565305 0.16627266605117053 1)
        (0.6087496113562257 0.17072930257578053 1)
        (0.5818594858769538 0.1748957696797893 1)
        (0.5549929582977443 0.17873987650329712 1)
        (0.5280873552751782 0.1822931457966907 1)
        (0.5007827142053005 0.18555403690775535 1)
        (0.4721344479624742 0.1884382804409715 1)
        (0.4402531497565428 0.19076941430210181 1)
        (0.4042336315889362 0.1923971394936283 1)
        (0.3678405630192846 0.19327329991219405 1)
        (0.3365939531650711 0.1933775491591253 1)
        (0.3106475422821223 0.1927510557220498 1)
        (0.28653082833451676 0.19147883153281725 1)
        (0.2609461786795975 0.18950832021058195 1)
    )
    polyLine 14 18
    (
        (0.23222828524870476 0.186715112695373 0)
        (0.20165949746635103 0.18313662592834148 0)
        (0.17177064897349786 0.17888214049664913 0)
        (0.14385992912309814 0.17400075411151827 0)
        (0.11835244770166163 0.16860061934855336 0)
        (0.09528572350198794 0.16291734347177161 0)
        (0.07426963937461543 0.1571237810521199 0)
        (0.055087300902068426 0.15126669320693212 0)
        (0.03785614824596995 0.14540174764014754 0)
        (0.022424682190864485 0.13956357833527455 0)
        (0.008103417010399405 0.13356923790806968 0)
        (-0.00567635512287909 0.1271407792395582 0)
        (-0.018855739621021217 0.12024548101534406 0)
        (-0.030984944628361075 0.11310764434548051 0)
        (-0.041470558381694264 0.10617057902569846 0)
        (-0.05032664781274477 0.09960959247233546 0)
        (-0.05903935671318592 0.09224119931433061 0)
        (-0.06569668730658262 0.08567207093094892 0)
        (-0.07847507904672542 0.07044882071628061 0)
        (-0.09210538339455374 0.044369542566864206 0)
        (-0.09831651342219322 0.020805411590707423 0)
        (-0.09975562338925031 0.006986816315179516 0)
    )
    polyLine 33 37
    (
        (0.23222828524870476 0.186715112695373 1)
        (0.20165949746635103 0.18313662592834148 1)
        (0.17177064897349786 0.17888214049664913 1)
        (0.14385992912309814 0.17400075411151827 1)
        (0.11835244770166163 0.16860061934855336 1)
        (0.09528572350198794 0.16291734347177161 1)
        (0.07426963937461543 0.1571237810521199 1)
        (0.055087300902068426 0.15126669320693212 1)
        (0.03785614824596995 0.14540174764014754 1)
        (0.022424682190864485 0.13956357833527455 1)
        (0.008103417010399405 0.13356923790806968 1)
        (-0.00567635512287909 0.1271407792395582 1)
        (-0.018855739621021217 0.12024548101534406 1)
        (-0.030984944628361075 0.11310764434548051 1)
        (-0.041470558381694264 0.10617057902569846 1)
        (-0.05032664781274477 0.09960959247233546 1)
        (-0.05903935671318592 0.09224119931433061 1)
        (-0.06569668730658262 0.08567207093094892 1)
        (-0.07847507904672542 0.07044882071628061 1)
        (-0.09210538339455374 0.044369542566864206 1)
        (-0.09831651342219322 0.020805411590707423 1)
        (-0.09975562338925031 0.006986816315179516 1)
    )
    polyLine 18 17
    (
        (-0.07603979027693984 -0.066292022519901 0)
        (-0.06344879694871688 -0.07929670581832082 0)
        (-0.04766142700387672 -0.09062344400619968 0)
        (-0.0405448120859134 -0.0946098051343594 0)
        (-0.031241399222723953 -0.09915289465555473 0)
        (-0.01850539567405523 -0.10388715103103059 0)
        (-0.007018535438236911 -0.10701693578845095 0)
        (0.0044936661670343415 -0.10937462535073449 0)
        (0.016258714139583907 -0.11118416219544136 0)
        (0.02784543801476538 -0.11256335641157456 0)
        (0.03949761947896124 -0.11370959397037186 0)
        (0.051891989539470114 -0.11473388203809265 0)
        (0.06551095358111692 -0.11565612234325015 0)
        (0.08073985651001922 -0.11648954771081446 0)
        (0.09782269422037602 -0.1172653407445095 0)
        (0.11651942380367489 -0.11802086421822586 0)
        (0.13657542206586795 -0.11880963761561755 0)
        (0.15844827714083673 -0.11971989253817894 0)
        (0.18292206263211003 -0.12080766665855863 0)
        (0.21019047745750571 -0.12201483154672665 0)
        (0.23887770128318686 -0.1232115469621782 0)
    )
    polyLine 37 36
    (
        (-0.07603979027693984 -0.066292022519901 1)
        (-0.06344879694871688 -0.07929670581832082 1)
        (-0.04766142700387672 -0.09062344400619968 1)
        (-0.0405448120859134 -0.0946098051343594 1)
        (-0.031241399222723953 -0.09915289465555473 1)
        (-0.01850539567405523 -0.10388715103103059 1)
        (-0.007018535438236911 -0.10701693578845095 1)
        (0.0044936661670343415 -0.10937462535073449 1)
        (0.016258714139583907 -0.11118416219544136 1)
        (0.02784543801476538 -0.11256335641157456 1)
        (0.03949761947896124 -0.11370959397037186 1)
        (0.051891989539470114 -0.11473388203809265 1)
        (0.06551095358111692 -0.11565612234325015 1)
        (0.08073985651001922 -0.11648954771081446 1)
        (0.09782269422037602 -0.1172653407445095 1)
        (0.11651942380367489 -0.11802086421822586 1)
        (0.13657542206586795 -0.11880963761561755 1)
        (0.15844827714083673 -0.11971989253817894 1)
        (0.18292206263211003 -0.12080766665855863 1)
        (0.21019047745750571 -0.12201483154672665 1)
        (0.23887770128318686 -0.1232115469621782 1)
    )
    polyLine 17 13
    (
        (0.2660395527426199 -0.12426630417786866 0)
        (0.2901593977296111 -0.12508572083568156 0)
        (0.31272185808223557 -0.1256201602875251 0)
        (0.3367327419153361 -0.12589161913834387 0)
        (0.36605330176494616 -0.12602313291788095 0)
        (0.40067253411764137 -0.12610092654068356 0)
        (0.4347021574960879 -0.12610276746369833 0)
        (0.46460119284158224 -0.12593679902715874 0)
        (0.492096027658273 -0.12548465529287245 0)
        (0.5190001446766601 -0.12470870911415638 0)
        (0.5456660731923948 -0.12366772207914911 0)
        (0.572152605554024 -0.1224212088439791 0)
        (0.5984891902653622 -0.12100759572977321 0)
        (0.6246514538203006 -0.11947202641464014 0)
        (0.6506416926176948 -0.11786543611193485 0)
        (0.6765087964944896 -0.11622597356674294 0)
        (0.7021668581658692 -0.11458140476816679 0)
        (0.726945507304053 -0.11296875846808385 0)
        (0.7499302394373524 -0.1114316039513942 0)
        (0.771184240578552 -0.10998803974892565 0)
        (0.7916167649454869 -0.10862903724369456 0)
        (0.811841109752954 -0.10735348475517774 0)
        (0.8320623824292392 -0.10616393740647787 0)
        (0.8523763763181766 -0.10503995543679906 0)
        (0.8732414457111528 -0.1039452708644079 0)
        (0.8962661124570485 -0.10283473946479045 0)
        (0.9218588506913217 -0.10174734840939223 0)
        (0.9466842981559642 -0.1008970025272819 0)
    )
    polyLine 36 32
    (
        (0.2660395527426199 -0.12426630417786866 1)
        (0.2901593977296111 -0.12508572083568156 1)
        (0.31272185808223557 -0.1256201602875251 1)
        (0.3367327419153361 -0.12589161913834387 1)
        (0.36605330176494616 -0.12602313291788095 1)
        (0.40067253411764137 -0.12610092654068356 1)
        (0.4347021574960879 -0.12610276746369833 1)
        (0.46460119284158224 -0.12593679902715874 1)
        (0.492096027658273 -0.12548465529287245 1)
        (0.5190001446766601 -0.12470870911415638 1)
        (0.5456660731923948 -0.12366772207914911 1)
        (0.572152605554024 -0.1224212088439791 1)
        (0.5984891902653622 -0.12100759572977321 1)
        (0.6246514538203006 -0.11947202641464014 1)
        (0.6506416926176948 -0.11786543611193485 1)
        (0.6765087964944896 -0.11622597356674294 1)
        (0.7021668581658692 -0.11458140476816679 1)
        (0.726945507304053 -0.11296875846808385 1)
        (0.7499302394373524 -0.1114316039513942 1)
        (0.771184240578552 -0.10998803974892565 1)
        (0.7916167649454869 -0.10862903724369456 1)
        (0.811841109752954 -0.10735348475517774 1)
        (0.8320623824292392 -0.10616393740647787 1)
        (0.8523763763181766 -0.10503995543679906 1)
        (0.8732414457111528 -0.1039452708644079 1)
        (0.8962661124570485 -0.10283473946479045 1)
        (0.9218588506913217 -0.10174734840939223 1)
        (0.9466842981559642 -0.1008970025272819 1)
    )
    spline 12 15
    (
        (0.9432575128669335 0.006718463230968455 0)
        (0.9180156105114361 0.010618053264790267 0)
        (0.8917519010541176 0.01499636409170594 0)
        (0.8682247053836925 0.019232616741896538 0)
        (0.8469966914603365 0.023344181150486996 0)
        (0.8263636363636366 0.02753626573776837 0)
        (0.8057575757575759 0.03182970517218263 0)
        (0.7851514252073567 0.03614579414086885 0)
        (0.7644771247410241 0.04040253540286411 0)
        (0.7432074519157125 0.04464379925321054 0)
        (0.720365226337449 0.0490599279835391 0)
        (0.6957223721057307 0.053720833333333336 0)
        (0.6701480017078147 0.05848096986083671 0)
        (0.6443939393939394 0.06317644149919488 0)
        (0.6186363636363639 0.06770698210504748 0)
        (0.5928787878787882 0.07199674987836459 0)
        (0.5671212121212125 0.07598781607290878 0)
        (0.5413636363636367 0.0796730223914578 0)
        (0.5156060606060608 0.08307511677281487 0)
        (0.48983794451738344 0.08615478129445384 0)
        (0.46353075268082783 0.08880908578648994 0)
        (0.43444958847736626 0.09093796296296298 0)
        (0.4007892097506216 0.09245647730751036 0)
        (0.3663796018031557 0.09328397252009202 0)
        (0.3374810393497263 0.09338148384602912 0)
        (0.31444721514614676 0.09282326936546931 0)
        (0.2930672995924687 0.09169268748719352 0)
        (0.2696958868536214 0.08989184262344066 0)
    )
    spline 31 34
    (
        (0.9432575128669335 0.006718463230968455 1)
        (0.9180156105114361 0.010618053264790267 1)
        (0.8917519010541176 0.01499636409170594 1)
        (0.8682247053836925 0.019232616741896538 1)
        (0.8469966914603365 0.023344181150486996 1)
        (0.8263636363636366 0.02753626573776837 1)
        (0.8057575757575759 0.03182970517218263 1)
        (0.7851514252073567 0.03614579414086885 1)
        (0.7644771247410241 0.04040253540286411 1)
        (0.7432074519157125 0.04464379925321054 1)
        (0.720365226337449 0.0490599279835391 1)
        (0.6957223721057307 0.053720833333333336 1)
        (0.6701480017078147 0.05848096986083671 1)
        (0.6443939393939394 0.06317644149919488 1)
        (0.6186363636363639 0.06770698210504748 1)
        (0.5928787878787882 0.07199674987836459 1)
        (0.5671212121212125 0.07598781607290878 1)
        (0.5413636363636367 0.0796730223914578 1)
        (0.5156060606060608 0.08307511677281487 1)
        (0.48983794451738344 0.08615478129445384 1)
        (0.46353075268082783 0.08880908578648994 1)
        (0.43444958847736626 0.09093796296296298 1)
        (0.4007892097506216 0.09245647730751036 1)
        (0.3663796018031557 0.09328397252009202 1)
        (0.3374810393497263 0.09338148384602912 1)
        (0.31444721514614676 0.09282326936546931 1)
        (0.2930672995924687 0.09169268748719352 1)
        (0.2696958868536214 0.08989184262344066 1)
    )
    arc 4 5 (-7.071072502792263 7.071063120935576 0)
    arc 3 4 (-7.071072502792263 -7.071063120935576 0)
    arc 23 24 (-7.071072502792263 7.071063120935576 1)
    arc 22 23 (-7.071072502792263 -7.071063120935576 1)
    spline 15 0
    (
        (0.2429063989787966 0.08728685772141088 0)
        (0.21448301573207676 0.08396224728502151 0)
        (0.18735307516267954 0.08010366108914505 0)
        (0.16275478650489086 0.07580205572644949 0)
        (0.14062500000000014 0.07111250000000002 0)
        (0.12050024393839621 0.06614840238444779 0)
        (0.10209311282820135 0.06107247015540387 0)
        (0.08570269278054783 0.05606849059718144 0)
        (0.07157293343457681 0.05125729269698405 0)
        (0.059346770973080575 0.0466294115290985 0)
        (0.04847163928921064 0.042079311522437005 0)
        (0.038568442006255074 0.0374613617180234 0)
        (0.029585903786311846 0.03276172718643715 0)
        (0.02183621195045884 0.028196364660883873 0)
        (0.015686116809916845 0.02411502174259503 0)
        (0.01131661522633747 0.020868827160493857 0)
        (0.008453338797441002 0.018452744575734824 0)
        (0.006372772951008842 0.016346802102191763 0)
        (0.003816194059300758 0.013632041763321525 0)
        (0.001586258053867002 0.00941419501172509 0)
        (0.0002934636806892476 0.004189984549280028 0)
        (0.0 0.0 0)
    )
    spline 34 19
    (
        (0.2429063989787966 0.08728685772141088 1)
        (0.21448301573207676 0.08396224728502151 1)
        (0.18735307516267954 0.08010366108914505 1)
        (0.16275478650489086 0.07580205572644949 1)
        (0.14062500000000014 0.07111250000000002 1)
        (0.12050024393839621 0.06614840238444779 1)
        (0.10209311282820135 0.06107247015540387 1)
        (0.08570269278054783 0.05606849059718144 1)
        (0.07157293343457681 0.05125729269698405 1)
        (0.059346770973080575 0.0466294115290985 1)
        (0.04847163928921064 0.042079311522437005 1)
        (0.038568442006255074 0.0374613617180234 1)
        (0.029585903786311846 0.03276172718643715 1)
        (0.02183621195045884 0.028196364660883873 1)
        (0.015686116809916845 0.02411502174259503 1)
        (0.01131661522633747 0.020868827160493857 1)
        (0.008453338797441002 0.018452744575734824 1)
        (0.006372772951008842 0.016346802102191763 1)
        (0.003816194059300758 0.013632041763321525 1)
        (0.001586258053867002 0.00941419501172509 1)
        (0.0002934636806892476 0.004189984549280028 1)
        (0.0 0.0 1)
    )
    spline 0 16
    (
        (0.0006234636806892377 -0.002083413341473256 0)
        (0.001886258053866989 -0.003591153922773938 0)
        (0.004016194059300744 -0.005011391809965982 0)
        (0.006372772951008829 -0.006299328891145931 0)
        (0.008453338797440986 -0.007368757826195853 0)
        (0.011316615226337428 -0.008437438271604935 0)
        (0.01568611680991677 -0.009628544456165289 0)
        (0.02183621195045876 -0.010889925494615583 0)
        (0.029585903786311808 -0.012076210869020792 0)
        (0.03856844200625498 -0.013139932685580797 0)
        (0.0484716392892106 -0.014113073105206838 0)
        (0.0593467709730805 -0.015012138001111938 0)
        (0.07157293343457671 -0.015840029451090476 0)
        (0.08570269278054785 -0.016612772351615335 0)
        (0.10209311282820138 -0.017356564729016526 0)
        (0.12050024393839628 -0.018100130278492423 0)
        (0.1406249999999999 -0.018891666666666664 0)
        (0.1627547865048908 -0.01981266568697803 0)
        (0.1873530751626795 -0.020905884252267512 0)
        (0.21448301573207673 -0.022107003449217965 0)
        (0.24290639897879668 -0.023292731942796647 0)
    )
    spline 19 35
    (
        (0.0006234636806892377 -0.002083413341473256 1)
        (0.001886258053866989 -0.003591153922773938 1)
        (0.004016194059300744 -0.005011391809965982 1)
        (0.006372772951008829 -0.006299328891145931 1)
        (0.008453338797440986 -0.007368757826195853 1)
        (0.011316615226337428 -0.008437438271604935 1)
        (0.01568611680991677 -0.009628544456165289 1)
        (0.02183621195045876 -0.010889925494615583 1)
        (0.029585903786311808 -0.012076210869020792 1)
        (0.03856844200625498 -0.013139932685580797 1)
        (0.0484716392892106 -0.014113073105206838 1)
        (0.0593467709730805 -0.015012138001111938 1)
        (0.07157293343457671 -0.015840029451090476 1)
        (0.08570269278054785 -0.016612772351615335 1)
        (0.10209311282820138 -0.017356564729016526 1)
        (0.12050024393839628 -0.018100130278492423 1)
        (0.1406249999999999 -0.018891666666666664 1)
        (0.1627547865048908 -0.01981266568697803 1)
        (0.1873530751626795 -0.020905884252267512 1)
        (0.21448301573207673 -0.022107003449217965 1)
        (0.24290639897879668 -0.023292731942796647 1)
    )
    spline 16 12
    (
        (0.26969588685362145 -0.02433317042900273 0)
        (0.2930672995924689 -0.02512800924344877 0)
        (0.31444721514614665 -0.025635045680389615 0)
        (0.3374810393497263 -0.025894418922789413 0)
        (0.3663796018031554 -0.02602366527787265 0)
        (0.4007892097506215 -0.026100994606723382 0)
        (0.43444958847736626 -0.026103086419753098 0)
        (0.46353075268082816 -0.025942528401976184 0)
        (0.48983794451738377 -0.025510153240955073 0)
        (0.5156060606060607 -0.02476632474535264 0)
        (0.5413636363636363 -0.023760319764132717 0)
        (0.5671212121212119 -0.022547863650557973 0)
        (0.5928787878787877 -0.021165102846929393 0)
        (0.6186363636363634 -0.019653096896842238 0)
        (0.6443939393939395 -0.018060799047041654 0)
        (0.6701480017078147 -0.016428477156853923 0)
        (0.695722372105731 -0.014789277827106524 0)
        (0.7203652263374485 -0.013185493827160506 0)
        (0.7432074519157121 -0.011657839223691967 0)
        (0.7644771247410242 -0.010213220294606492 0)
        (0.7851514252073566 -0.008838259202482006 0)
        (0.8057575757575756 -0.007538703213929665 0)
        (0.8263636363636362 -0.006326447988525366 0)
        (0.8469966914603363 -0.005184765332176436 0)
        (0.8682247053836918 -0.00407118855830195 0)
        (0.8917519010541175 -0.0029366819490927315 0)
        (0.9180156105114365 -0.0018212281758931206 0)
        (0.9432575128669338 -0.0009557340613329269 0)
    )
    spline 35 31
    (
        (0.26969588685362145 -0.02433317042900273 1)
        (0.2930672995924689 -0.02512800924344877 1)
        (0.31444721514614665 -0.025635045680389615 1)
        (0.3374810393497263 -0.025894418922789413 1)
        (0.3663796018031554 -0.02602366527787265 1)
        (0.4007892097506215 -0.026100994606723382 1)
        (0.43444958847736626 -0.026103086419753098 1)
        (0.46353075268082816 -0.025942528401976184 1)
        (0.48983794451738377 -0.025510153240955073 1)
        (0.5156060606060607 -0.02476632474535264 1)
        (0.5413636363636363 -0.023760319764132717 1)
        (0.5671212121212119 -0.022547863650557973 1)
        (0.5928787878787877 -0.021165102846929393 1)
        (0.6186363636363634 -0.019653096896842238 1)
        (0.6443939393939395 -0.018060799047041654 1)
        (0.6701480017078147 -0.016428477156853923 1)
        (0.695722372105731 -0.014789277827106524 1)
        (0.7203652263374485 -0.013185493827160506 1)
        (0.7432074519157121 -0.011657839223691967 1)
        (0.7644771247410242 -0.010213220294606492 1)
        (0.7851514252073566 -0.008838259202482006 1)
        (0.8057575757575756 -0.007538703213929665 1)
        (0.8263636363636362 -0.006326447988525366 1)
        (0.8469966914603363 -0.005184765332176436 1)
        (0.8682247053836918 -0.00407118855830195 1)
        (0.8917519010541175 -0.0029366819490927315 1)
        (0.9180156105114365 -0.0018212281758931206 1)
        (0.9432575128669338 -0.0009557340613329269 1)
    )
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          (1 2 13 10)
          (2 3 17 13)
          (3 4 18 17)
          (18 4 5 14)
          (11 14 5 6)
          (8 11 6 7)
          (9 12 11 8)
          (12 15 14 11)
          (0 18 14 15)
          (17 18 0 16)
          (13 17 16 12)
          (10 13 12 9)
          (21 20 29 32)
          (22 21 32 36)
          (23 22 36 37)
          (23 37 33 24)
          (33 30 25 24)
          (30 27 26 25)
          (31 28 27 30)
          (34 31 30 33)
          (37 19 34 33)
          (37 36 35 19)
          (36 32 31 35)
          (32 29 28 31)
         );
     }
    farfield
    {
        type patch;    // 纯粹的数学边界，没有任何几何性质
        faces
        (
          (4 23 24 5)
          (5 24 25 6)
          (6 25 26 7)
          (27 8 7 26)
          (28 9 8 27)
          (29 10 9 28)
          (20 1 10 29)
          (21 2 1 20)
          (22 3 2 21)
          (23 4 3 22)
         );
     }
    airfoil
    {
        type wall;     // 壁面，可对其使用壁面函数
        faces
        (
          (34 15 12 31)
          (19 0 15 34)
          (0 19 35 16)
          (16 35 31 12)
         );
     }
);
